from pprint import pprint
from paddlenlp import Taskflow
import sys

def predit_go():
    schema = ['出发地', '目的地', '费用', '时间']
    # 设定抽取目标和定制化模型权重路径
    my_ie = Taskflow("information_extraction", schema=schema,task_path='/home/DiskA/zncsPython/paddlenlp/uie/checkpoint/model_best')
    print(my_ie("城市内交通费7月5日金额114广州至佛山"))

def predit_billvalue():
    schema = ["单据名称", "企业名称", "企业税号", "企业地址", "企业电话", "对方企业名称", "对方企业税号", "对方企业地址", "对方企业电话", "日期", "合计金额", "合计税额", "价税合计小写", "价税合计大写", "企业开户行", "企业银行账号", "对方企业开户行", "对方企业银行账号", "项目", "单位", "数量", "单价", "金额", "税率", "税额", "密码", "流水号", "金额大写", "金额小写", "凭证种类", "结算方式", "产品名称", "计税依据", "制表人", "审核人", "医疗保险金额", "养老保险金额", "失业保险金额", "工伤保险金额", "四险合计金额", "退货率", "部门名称", "用途", "材料名称", "工时", "分配率", "原值合计", "折旧额合计", "资产类别", "资产名称", "原值", "投入使用日期", "使用年限", "折旧率", "折旧额", "证券代码", "证券名称", "持有数量", "账面价值", "收盘价", "市值", "公允价值变动", "人员姓名", "出差事由", "地点", "交通工具", "身份信息", "税种", "纳税所属期限", "处理意见", "残值", "净损益", "利率", "本金", "利息", "社保", "盘点原因", "贴现利息", "贴现金额", "短缺原因", "完工率", "期初成本", "本期生产成本", "完工产品成本", "在产品成本", "科目", "破产原因", "摊销额", "处置原因", "销项税额", "进项税额", "进项税额转出", "减免税额", "增值税应纳税额", "应交城市维护建设税", "应交教育费附加", "应交地方教育费附加", "手续费", "印花税", "证券操作"]
    # 设定抽取目标和定制化模型权重路径
    my_ie = Taskflow("information_extraction", schema=schema,task_path='/home/DiskA/zncsPython/paddlenlp/uie/billvalue/checkpoint/model_best')
    print(my_ie("城市内交通费7月5日金额114广州至佛山"))


if __name__ == '__main__':
    #print(sys.path)
    #predit_go()
    predit_billvalue()
